zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT1189/iar/startup_MIMXRT1189_cm7.s
        PUBWEAK LPI2C4_IRQHandler
        PUBWEAK LPI2C4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPI2C4_IRQHandler
        LDR     R0, =LPI2C4_DriverIRQHandler
        BX      R0

        PUBWEAK LPIT2_IRQHandler
        PUBWEAK LPSPI3_IRQHandler
        PUBWEAK LPSPI3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI3_IRQHandler
        LDR     R0, =LPSPI3_DriverIRQHandler
        BX      R0

        PUBWEAK LPSPI4_IRQHandler
        PUBWEAK LPSPI4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPSPI4_IRQHandler
        LDR     R0, =LPSPI4_DriverIRQHandler
        BX      R0

        PUBWEAK LPTMR2_IRQHandler
        PUBWEAK LPUART3_IRQHandler
        PUBWEAK LPUART3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART3_IRQHandler
        LDR     R0, =LPUART3_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART4_IRQHandler
        PUBWEAK LPUART4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART4_IRQHandler
        LDR     R0, =LPUART4_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART5_IRQHandler
        PUBWEAK LPUART5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART5_IRQHandler
        LDR     R0, =LPUART5_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART6_IRQHandler
        PUBWEAK LPUART6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART6_IRQHandler
        LDR     R0, =LPUART6_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved88_IRQHandler
        PUBWEAK BBNSM_IRQHandler
        PUBWEAK SYS_CTR1_IRQHandler
        PUBWEAK TPM3_IRQHandler
        PUBWEAK TPM4_IRQHandler
        PUBWEAK TPM5_IRQHandler
        PUBWEAK TPM6_IRQHandler
        PUBWEAK RTWDOG3_IRQHandler
        PUBWEAK RTWDOG4_IRQHandler
        PUBWEAK RTWDOG5_IRQHandler
        PUBWEAK TRDC_MGR_WKUP_IRQHandler
        PUBWEAK TMPSNS_INT_IRQHandler
        PUBWEAK BBSM_IRQHandler
        PUBWEAK LDO_AON_ANA_IRQHandler
        PUBWEAK USDHC1_IRQHandler
        PUBWEAK USDHC1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USDHC1_IRQHandler
        LDR     R0, =USDHC1_DriverIRQHandler
        BX      R0

        PUBWEAK USDHC2_IRQHandler
        PUBWEAK USDHC2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
USDHC2_IRQHandler
        LDR     R0, =USDHC2_DriverIRQHandler
        BX      R0

        PUBWEAK TRDC_MGR_MEGA_IRQHandler
        PUBWEAK SFA_IRQHandler
        PUBWEAK LDO_AON_DIG_IRQHandler
        PUBWEAK MECC1_IRQHandler
        PUBWEAK MECC2_IRQHandler
        PUBWEAK ADC1_IRQHandler
        PUBWEAK DMA_ERROR_IRQHandler
        PUBWEAK DMA_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA_ERROR_IRQHandler
        LDR     R0, =DMA_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH0_IRQHandler
        PUBWEAK DMA3_CH0_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH0_IRQHandler
        LDR     R0, =DMA3_CH0_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH1_IRQHandler
        PUBWEAK DMA3_CH1_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH1_IRQHandler
        LDR     R0, =DMA3_CH1_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH2_IRQHandler
        PUBWEAK DMA3_CH2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH2_IRQHandler
        LDR     R0, =DMA3_CH2_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH3_IRQHandler
        PUBWEAK DMA3_CH3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH3_IRQHandler
        LDR     R0, =DMA3_CH3_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH4_IRQHandler
        PUBWEAK DMA3_CH4_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH4_IRQHandler
        LDR     R0, =DMA3_CH4_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH5_IRQHandler
        PUBWEAK DMA3_CH5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH5_IRQHandler
        LDR     R0, =DMA3_CH5_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH6_IRQHandler
        PUBWEAK DMA3_CH6_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH6_IRQHandler
        LDR     R0, =DMA3_CH6_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH7_IRQHandler
        PUBWEAK DMA3_CH7_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH7_IRQHandler
        LDR     R0, =DMA3_CH7_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH8_IRQHandler
        PUBWEAK DMA3_CH8_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH8_IRQHandler
        LDR     R0, =DMA3_CH8_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH9_IRQHandler
        PUBWEAK DMA3_CH9_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH9_IRQHandler
        LDR     R0, =DMA3_CH9_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH10_IRQHandler
        PUBWEAK DMA3_CH10_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH10_IRQHandler
        LDR     R0, =DMA3_CH10_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH11_IRQHandler
        PUBWEAK DMA3_CH11_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH11_IRQHandler
        LDR     R0, =DMA3_CH11_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH12_IRQHandler
        PUBWEAK DMA3_CH12_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH12_IRQHandler
        LDR     R0, =DMA3_CH12_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH13_IRQHandler
        PUBWEAK DMA3_CH13_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH13_IRQHandler
        LDR     R0, =DMA3_CH13_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH14_IRQHandler
        PUBWEAK DMA3_CH14_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH14_IRQHandler
        LDR     R0, =DMA3_CH14_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH15_IRQHandler
        PUBWEAK DMA3_CH15_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH15_IRQHandler
        LDR     R0, =DMA3_CH15_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH16_IRQHandler
        PUBWEAK DMA3_CH16_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH16_IRQHandler
        LDR     R0, =DMA3_CH16_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH17_IRQHandler
        PUBWEAK DMA3_CH17_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH17_IRQHandler
        LDR     R0, =DMA3_CH17_DriverIRQHandler
        BX      R0

