zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT1180/MIMXRT1189/iar/startup_MIMXRT1189_cm7.s
        PUBWEAK DMA3_CH18_IRQHandler
        PUBWEAK DMA3_CH18_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH18_IRQHandler
        LDR     R0, =DMA3_CH18_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH19_IRQHandler
        PUBWEAK DMA3_CH19_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH19_IRQHandler
        LDR     R0, =DMA3_CH19_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH20_IRQHandler
        PUBWEAK DMA3_CH20_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH20_IRQHandler
        LDR     R0, =DMA3_CH20_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH21_IRQHandler
        PUBWEAK DMA3_CH21_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH21_IRQHandler
        LDR     R0, =DMA3_CH21_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH22_IRQHandler
        PUBWEAK DMA3_CH22_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH22_IRQHandler
        LDR     R0, =DMA3_CH22_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH23_IRQHandler
        PUBWEAK DMA3_CH23_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH23_IRQHandler
        LDR     R0, =DMA3_CH23_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH24_IRQHandler
        PUBWEAK DMA3_CH24_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH24_IRQHandler
        LDR     R0, =DMA3_CH24_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH25_IRQHandler
        PUBWEAK DMA3_CH25_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH25_IRQHandler
        LDR     R0, =DMA3_CH25_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH26_IRQHandler
        PUBWEAK DMA3_CH26_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH26_IRQHandler
        LDR     R0, =DMA3_CH26_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH27_IRQHandler
        PUBWEAK DMA3_CH27_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH27_IRQHandler
        LDR     R0, =DMA3_CH27_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH28_IRQHandler
        PUBWEAK DMA3_CH28_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH28_IRQHandler
        LDR     R0, =DMA3_CH28_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH29_IRQHandler
        PUBWEAK DMA3_CH29_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH29_IRQHandler
        LDR     R0, =DMA3_CH29_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH30_IRQHandler
        PUBWEAK DMA3_CH30_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH30_IRQHandler
        LDR     R0, =DMA3_CH30_DriverIRQHandler
        BX      R0

        PUBWEAK DMA3_CH31_IRQHandler
        PUBWEAK DMA3_CH31_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA3_CH31_IRQHandler
        LDR     R0, =DMA3_CH31_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_ERROR_IRQHandler
        PUBWEAK DMA4_ERROR_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_ERROR_IRQHandler
        LDR     R0, =DMA4_ERROR_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH0_CH1_CH32_CH33_IRQHandler
        PUBWEAK DMA4_CH0_CH1_CH32_CH33_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH0_CH1_CH32_CH33_IRQHandler
        LDR     R0, =DMA4_CH0_CH1_CH32_CH33_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH2_CH3_CH34_CH35_IRQHandler
        PUBWEAK DMA4_CH2_CH3_CH34_CH35_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH2_CH3_CH34_CH35_IRQHandler
        LDR     R0, =DMA4_CH2_CH3_CH34_CH35_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH4_CH5_CH36_CH37_IRQHandler
        PUBWEAK DMA4_CH4_CH5_CH36_CH37_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH4_CH5_CH36_CH37_IRQHandler
        LDR     R0, =DMA4_CH4_CH5_CH36_CH37_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH6_CH7_CH38_CH39_IRQHandler
        PUBWEAK DMA4_CH6_CH7_CH38_CH39_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH6_CH7_CH38_CH39_IRQHandler
        LDR     R0, =DMA4_CH6_CH7_CH38_CH39_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH8_CH9_CH40_CH41_IRQHandler
        PUBWEAK DMA4_CH8_CH9_CH40_CH41_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH8_CH9_CH40_CH41_IRQHandler
        LDR     R0, =DMA4_CH8_CH9_CH40_CH41_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH10_CH11_CH42_CH43_IRQHandler
        PUBWEAK DMA4_CH10_CH11_CH42_CH43_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH10_CH11_CH42_CH43_IRQHandler
        LDR     R0, =DMA4_CH10_CH11_CH42_CH43_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH12_CH13_CH44_CH45_IRQHandler
        PUBWEAK DMA4_CH12_CH13_CH44_CH45_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH12_CH13_CH44_CH45_IRQHandler
        LDR     R0, =DMA4_CH12_CH13_CH44_CH45_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH14_CH15_CH46_CH47_IRQHandler
        PUBWEAK DMA4_CH14_CH15_CH46_CH47_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH14_CH15_CH46_CH47_IRQHandler
        LDR     R0, =DMA4_CH14_CH15_CH46_CH47_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH16_CH17_CH48_CH49_IRQHandler
        PUBWEAK DMA4_CH16_CH17_CH48_CH49_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH16_CH17_CH48_CH49_IRQHandler
        LDR     R0, =DMA4_CH16_CH17_CH48_CH49_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH18_CH19_CH50_CH51_IRQHandler
        PUBWEAK DMA4_CH18_CH19_CH50_CH51_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH18_CH19_CH50_CH51_IRQHandler
        LDR     R0, =DMA4_CH18_CH19_CH50_CH51_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH20_CH21_CH52_CH53_IRQHandler
        PUBWEAK DMA4_CH20_CH21_CH52_CH53_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH20_CH21_CH52_CH53_IRQHandler
        LDR     R0, =DMA4_CH20_CH21_CH52_CH53_DriverIRQHandler
        BX      R0

        PUBWEAK DMA4_CH22_CH23_CH54_CH55_IRQHandler
        PUBWEAK DMA4_CH22_CH23_CH54_CH55_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
DMA4_CH22_CH23_CH54_CH55_IRQHandler
        LDR     R0, =DMA4_CH22_CH23_CH54_CH55_DriverIRQHandler
        BX      R0

